clear
clc
%读取数据，并进行标准化变换
X = [5561.54 1571.74 1286.32 1096.57 1563.10 2293.23 2383.52 704.24;
5005.09 1153.66 1528.28 817.18 1220.92 1567.87 1608.97 520.49;
3155.40 1137.22 1097.41 574.84 808.88 1062.31 946.38 304.28;
2974.76 1137.11 1250.87 471.65 769.79 931.33 1041.91 228.53;
3553.48 1616.56 1028.19 672.64 869.71 1191.70 1383.53 512.81;
4378.14 1187.41 1270.95 507.40 913.13 1295.70 1145.46 533.29;
3307.14 1259.62 1285.28 510.49 914.47 954.96 1071.80 425.30;
3128.10 1217.04 941.25 494.49 864.89 749.05 906.19 321.95;
7108.62 1520.61 1646.19 1182.24 755.29 3373.19 2874.54 937.21;
4544.64 1166.91 1042.10 813.45 794.63 1357.96 1799.75 458.10;
5522.56 1546.46 1333.69 713.31 933.11 2392.63 2195.58 520.95;
3905.05 1010.61 988.12 579.59 633.93 920.77 1160.14 325.82;
5078.85 1105.31 1300.10 722.17 540.63 1777.06 1453.18 523.83;
3633.05 969.58 851.15 623.17 483.96 872.57 945.99 337.91;
3699.42 1394.11 1247.04 806.35 799.79 1410.45 1277.43 372.01;
3079.82 1141.76 963.59 633.32 790.87 915.12 988.95 324.03;
3996.27 1099.16 914.26 604.40 675.32 890.12 1037.24 260.74;
3970.42 1090.72 960.82 674.84 790.95 971.05 1110.11 376.62;
5866.91 975.06 1748.16 947.54 836.39 262308 1936.38 594.45;
4082.99 772.28 891.33 603.84 529.36 1376.03 1081.54 290.04;
4226.90 491.84 1106.39 565.51 536.40 1303.50 930.84 247.08;
4418.34 1294.30 1096.82 842.09 878.25 1044.36 1267.03 305.60;
4255.48 1042.45 819.28 590.51 564.93 1121.45 947.01 338.03;
3597.94 851.50 836.54 525.70 471.39 871.15 934.73 260.27;
4272.29 1026.50 739.20 331.94 606.86 1216.46 732.95 150.42;
4262.77 1011.82 634.94 310.22 317.08 966.74 419.59 400.38;
3586.13 1047.61 1007.68 618.16 862.70 967.52 1281.58 400.68;
3183.79 1022.62 846.26 546.23 654.82 817.17 936.33 301.40;
3315.94 945.14 802.73 538.54 610.02 787.63 880.86 311.72;
3352.83 1178.88 1069.15 596.81 816.87 1096.32 1043.72 403.71;
3235.77 1245.02 781.30 535.31 643.48 1003.89 812.36 411.63];
XZ = zscore(X); %数据标准化
%主成分分析
% 调用princomp函数根据标准化后原始样本观测数据作主成分分析
%返回主成分表达式的系数矩阵COEFF，主成分得分数据SCORE
%样本相关系数矩阵的特征值向量latent和每个观测值的霍特林T2统计量
[COEFF,SCORE,latent,tsquare] = princomp(XZ)
% 为了直观，定义元胞数组result1，用来存放特征值、贡献率和累积贡献率等数据
%princomp函数不返回贡献率，需要用协方差矩阵的特征值向量latent来计算
explained = 100*latent/sum(latent);%计算贡献率

[m, n] = size(X);%求X的行数和列数
result1 = cell(n+1, 4);%定义一个n+1行、4列的元胞数组
%result1中第一行存放的数据
result1(1,:) = {'特征值', '差值', '贡献率', '累积贡献率'};

%result1中第1列的第2行到最后一行存放的数据(latent)特征值
result1(2:end,1) = num2cell(latent);

%result1中第2列的第2行到倒数第2行存放的数据(latent的方差，特征值的方差)
result1(2:end-1,2) = num2cell(-diff(latent));

%result1中第3列和第4列的第2行到最后一行分别存放主成分的贡献率和累积贡献率
result1(2:end,3:4) = num2cell([explained, cumsum(explained)])

% 为了直观，定义元胞数组result2，用来存放前2个主成分表达式的系数数据
result2 = cell(n+1, 3); %定义一个n+1行，3列的元胞数组
result2(1,:) = {'标准化变量', '特征向量t1', '特征向量t2'};%result2的第一行数据
%result2(2:end, 1) = ['食品','衣着','居住','家庭设备及服务','交通和通讯','文教娱乐','医疗保健','其他';];%result2第1列
result2(2:end, 2:end) = num2cell(COEFF(:,1:2)) %存放前2个主成表达式的系数矩阵

% 为了直观，定义元胞数组result3，用来存放每一个地区总的消费性支出，以及前2个主成分的得分数据
cityname = ['北京','天津','河北','山西','内蒙古','辽宁','吉林','黑龙江','上海','江苏','浙江','安徽','福建','江西','山东','河南','湖北','湖南','广东','广西','海南','重庆','四川','贵州','云南','西藏','陕西','甘肃','青海','宁夏','新疆'];
sumXZ = sum(XZ,2);      %按行求和，提取每个地区总的消费性支出
[s1, id] = sortrows(SCORE,1);%将主成得分数据SOCRE按第一主成分得分(第一列)从小到大排序
result3 = cell(m+1, 4);%定义一个m+1行，4列的元胞数组
result3(1,:) = {'地区', '总支出', '第一主成分得分y1', '第二主成分得分y2'}; %第一行的数据
%result3(2:end, 1) = cityname(id);%result3的第一列的数据，排序后的城市名
%result3第2列为按id排序的sumXZ，第3列为第一主成分得分y1，第4列为第二主成分得分y2
result3(2:end, 2:end) = num2cell([sumXZ(id), s1(:,1:2)]) 