clear;clc;
A=[ 843 4000 920 1083 1166 1536 1692 2743 2741
 942 5215 1216 1280 1549 1924 2717 3743 4160
 895 6379 1836 2287 2715 3218 3240 4572 5439
 884 3770 978 1010 1227 1558 1755 2552 2632
 1002 3329 757 684 718 931 1422 1827 2222
 792 3039 759 765 1253 1296 1902 1822 2233
 930 2476 559 616 611 863 891 1539 1768
 758 2127 633 661 762 769 864 1241 1482
 886 2721 703 836 813 914 895 1272 1431
 859 1664 427 451 507 551 581 839 1107
 808 2435 772 790 839 990 771 1132 1316
 845 2661 557 599 670 855 1128 1639 1861
 877 2242 549 471 480 643 664 1173 1530
 787 3088 1061 1021 978 1102 1301 2373 2452
 943 3322 567 557 630 836 984 1994 2704
 866 3507 675 678 847 1187 1476 2107 2415
 924 3412 545 729 821 1017 1079 1878 2325
 1806 5869 1268 1227 1607 1765 2318 2959 3157
 1027 3605 651 835 924 1125 1194 2176 2411];%原始数据
for i=1:9
    SA(:,i)=(A(:,i)-mean(A(:,i)))/std(A(:,i)); %标准化
end
CM=corrcoef(SA);%系数矩阵
[V,D]=eig(CM);%特征值与特征向量
for i=1:9
    DS(i,1)=D(10-i,10-i);
end
%计算贡献率
for i=1:9
    DS(i,2)=DS(i,1)/sum(DS(:,1));%单个贡献率
    DS(i,3)=sum(DS(1:i,1))/sum(DS(:,1));%累计贡献率
end
%假定主成分的信息保留率为T
T=0.95;
for k=1:9
    if DS(k,3) >= T
        com_num=k;
        break;
    end
end
%提取主成分的特征向量
for j=1:com_num
    PV(:,j)=V(:,10-j);
end
%计算主成分得分
new_score=SA*PV;
for i=1:19
    total_score(i,1)=sum(new_score(i,:));
    total_score(i,2)=i;
end
%强主成分得分与总分放到同一个矩阵中
result_report=[new_score,total_score];
%按总分降序排列
result_report=sortrows(result_report,-com_num-1);
%输出结果
disp('特征值、贡献率、累计贡献率：')
DS
disp('信息保留率T对应的主成分数与特征向量：')
com_num
PV
disp('主成分得分及排序（最后一列为编号，其次为总得分）')
result_report